app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'bikikumarsingh2001@gmail.com'
 LIMIT 1
SELECT *
FROM `carts`
WHERE `user_id` = '1'
 LIMIT 1
---
   public function login()
    {
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $userModel = new \App\Models\UserModel();
        $user = $userModel->where('email', $email)->first();

        if ($user && password_verify($password, $user['password_hash'])) {
            // 1. Set Auth Session
            session()->set([
                'user_id'      => $user['id'],
                'user_name'    => $user['name'],
                'is_logged_in' => true
            ]);

            // 2. THE CART MERGE LOGIC
            $cartModel = new \App\Models\CartModel();
            $cartItemModel = new \App\Models\CartItemModel();

            // Find or create their permanent DB Cart
            $dbCart = $cartModel->where('user_id', $user['id'])->first();