app/Controllers/Cart.php

    private function getCartContents()
    {
        if (session()->get('is_logged_in')) {
            $cartModel = new CartModel();
            $cart = $cartModel->where('user_id', session()->get('user_id'))->first();
            if (!$cart) return [];

            $db = \Config\Database::connect();
            return $db->table('cart_items')
                      ->select('cart_items.product_id as id, cart_items.qty, products.name, products.price, products.image_path')
                      ->join('products', 'products.id = cart_items.product_id')
                      ->where('cart_items.cart_id', $cart['id'])
                      ->get()->getResultArray();
---
SELECT *
FROM `carts`
WHERE `user_id` = '1'
 LIMIT 1
SELECT `cart_items`.`product_id` as `id`, `cart_items`.`qty`, `products`.`name`, `products`.`price`, `products`.`image_path`
FROM `cart_items`
JOIN `products` ON `products`.`id` = `cart_items`.`product_id`
WHERE `cart_items`.`cart_id` = '1'