app/Controllers/Home.php

    public function index()
    {
        // Load the model
        $productModel = new ProductModel();

        // Fetch products where is_best_seller = 1
        $data['best_sellers'] = $productModel->where('is_best_seller', 1)->findAll();
---
SELECT *
FROM `products`
WHERE `is_best_seller` = 1