app/Controllers/Shop.php

SELECT *
FROM `products`
SELECT *
FROM `categories`
---
    public function index()
    {
        $productModel = new ProductModel();
        $categoryModel = new CategoryModel();

        // Fetch all products and categories
        $data['products'] = $productModel->findAll();
        $data['categories'] = $categoryModel->findAll();